Terraform plan for __production__
<details>
  <summary>Plan: 31 to add, 0 to change, 10 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudfoundry_service.k8s will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "k8s"  {
      + id                  = (known after apply)
      + name                = "aws-eks-service"
      + service_broker_name = (known after apply)
      + service_plans       = (known after apply)
    }

  # cloudfoundry_app.ssb will be destroyed
  - resource "cloudfoundry_app" "ssb" {
      - buildpack            = "binary_buildpack" -> null
      - command              = "source .profile && ./cloud-service-broker serve" -> null
      - disk_quota           = 2048 -> null
      - enable_ssh           = false -> null
      - environment          = (sensitive value)
      - health_check_timeout = 0 -> null
      - health_check_type    = "port" -> null
      - id                   = "a2c28ec7-97a0-4c4e-8010-7272a23ecb81" -> null
      - id_bg                = "a2c28ec7-97a0-4c4e-8010-7272a23ecb81" -> null
      - instances            = 1 -> null
      - memory               = 512 -> null
      - name                 = "ssb" -> null
      - path                 = "./app.zip" -> null
      - ports                = [
          - 8080,
        ] -> null
      - source_code_hash     = "3GGCTpBoxRtoa2jyyx/eJrHZ4OWuNn6voy0tcRFTNLI=" -> null
      - space                = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
      - stack                = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> null
      - stopped              = false -> null
      - strategy             = "blue-green" -> null
      - timeout              = 60 -> null

      - routes {
          - port  = 8080 -> null
          - route = "32a63578-b902-4648-92ab-5a945d16c6a1" -> null
        }

      - service_binding {
          - params           = (sensitive value)
          - service_instance = "3c9a0f58-c784-4f71-8872-f2052c95df43" -> null
        }
    }

  # cloudfoundry_route.ssb_uri will be destroyed
  - resource "cloudfoundry_route" "ssb_uri" {
      - domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> null
      - endpoint = "ssb-deep-dingo.app.cloud.gov" -> null
      - hostname = "ssb-deep-dingo" -> null
      - id       = "32a63578-b902-4648-92ab-5a945d16c6a1" -> null
      - space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/development"] will be destroyed
  - resource "cloudfoundry_service_broker" "space-scoped-broker" {
      - catalog_change                   = false -> null
      - catalog_hash                     = "pBU_2oU1XYXrWxR06w8kRUf0pB0=" -> null
      - fail_when_catalog_not_accessible = true -> null
      - id                               = "c17a5163-fc28-4dcf-b410-6c3fb9905c5b" -> null
      - name                             = "ssb-gsa-datagov-development" -> null
      - password                         = (sensitive value)
      - service_plans                    = {
          - "aws-eks-service/raw"           = "d81deb5a-df12-47cb-a371-4643b20723b9"
          - "csb-aws-dynamodb/ondemand"     = "1b48f7cb-e4fb-40c5-a070-648295b970b5"
          - "csb-aws-dynamodb/provisioned"  = "e805b308-22f4-4885-bca7-e67c1ceaeb61"
          - "csb-aws-mysql/large"           = "944b071b-543d-422b-9b4c-f724f0430b32"
          - "csb-aws-mysql/medium"          = "4e5174c7-c1ca-4ef1-a3b5-4fabc2da7865"
          - "csb-aws-mysql/small"           = "8b1f23c2-0f9e-400f-afd3-57c1d285d838"
          - "csb-aws-postgresql/large"      = "3d411165-85a4-4918-a176-f6ff23df91e8"
          - "csb-aws-postgresql/medium"     = "52be53d4-78de-4116-816f-94eb07842216"
          - "csb-aws-postgresql/small"      = "b1ba5c46-68a7-4974-9864-3fe5a2b97027"
          - "csb-aws-postgresql/subsume"    = "01cc9fc4-f040-403e-8bc1-6323ee260dd7"
          - "csb-aws-redis/large"           = "e341b1bf-d5ea-4d0d-a0a9-d3c94100c8cb"
          - "csb-aws-redis/large-ha"        = "ab9358ef-5f1d-4ac4-9f43-21c9c6c4fffe"
          - "csb-aws-redis/medium"          = "8100f3ac-40c2-4987-80f3-e2dec0fd47e0"
          - "csb-aws-redis/medium-ha"       = "f2e4e23d-a561-474c-8f69-7dbe66440cba"
          - "csb-aws-redis/small"           = "615dd03a-59f7-486a-bb2b-6a65e6127342"
          - "csb-aws-redis/small-ha"        = "9ecde3e1-57d2-4390-b9ba-fd0da6bf862b"
          - "csb-aws-s3-bucket/private"     = "d098bf0b-29ce-4169-9aa6-45361d7b4774"
          - "csb-aws-s3-bucket/public-read" = "bc4e0486-7a65-4913-b8d6-f444e5ebde04"
          - "solr-cloud/base"               = "b981c8b5-cd65-4b91-a82c-e6d52ec66c55"
        } -> null
      - services                         = {
          - "aws-eks-service"    = "891436f9-ba17-4e62-9704-b3ff51fca064"
          - "csb-aws-dynamodb"   = "cd929503-92a3-49af-afc0-5ae3ca350724"
          - "csb-aws-mysql"      = "ce76ccf5-4ea6-44c8-afa1-f772aaaf464c"
          - "csb-aws-postgresql" = "9d4459fa-71f1-48a3-9622-0a08cf652a75"
          - "csb-aws-redis"      = "cd8ff1e1-a160-4869-8ba9-4377cff90b4a"
          - "csb-aws-s3-bucket"  = "dd09b83f-8f75-48ec-8e5b-8798d88ae4cd"
          - "solr-cloud"         = "6ba2e523-c999-46cb-b25b-92190f9bfb77"
        } -> null
      - space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0" -> null
      - url                              = "https://ssb-deep-dingo.app.cloud.gov" -> null
      - username                         = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/management"] will be destroyed
  - resource "cloudfoundry_service_broker" "space-scoped-broker" {
      - catalog_change                   = false -> null
      - catalog_hash                     = "pBU_2oU1XYXrWxR06w8kRUf0pB0=" -> null
      - fail_when_catalog_not_accessible = true -> null
      - id                               = "e2c06bb8-665c-42d4-86e4-861ef33438e0" -> null
      - name                             = "ssb-gsa-datagov-management" -> null
      - password                         = (sensitive value)
      - service_plans                    = {
          - "aws-eks-service/raw"           = "2fc05cad-530a-4e7e-8729-cfd81447eb4d"
          - "csb-aws-dynamodb/ondemand"     = "02946fc6-3d44-4c4e-b23c-8dbaf8281399"
          - "csb-aws-dynamodb/provisioned"  = "ddb278e0-2150-4bb9-902f-a7c1b844bb57"
          - "csb-aws-mysql/large"           = "d03a5aa5-54e4-4236-8c00-9707dab79f02"
          - "csb-aws-mysql/medium"          = "21efe70a-34dc-4069-88b0-badfbe552865"
          - "csb-aws-mysql/small"           = "f8db7285-5fe2-4554-99b8-4a23f725b732"
          - "csb-aws-postgresql/large"      = "32fa2315-b7ee-452a-bf2b-e177a531a67c"
          - "csb-aws-postgresql/medium"     = "d181c1e5-aa24-4b89-a5e5-2ed4977dc0ff"
          - "csb-aws-postgresql/small"      = "2a4b285d-8c12-4abd-b0c3-4d2b92918251"
          - "csb-aws-postgresql/subsume"    = "16af9903-2e8b-4510-b024-1b0273470b40"
          - "csb-aws-redis/large"           = "5c5ed1a5-dbac-44f4-81e6-b1c063934188"
          - "csb-aws-redis/large-ha"        = "545f3afe-47be-4c94-9b48-ba96adf7357d"
          - "csb-aws-redis/medium"          = "5d794f3c-5b72-4ee3-a8be-7af110b75d6a"
          - "csb-aws-redis/medium-ha"       = "8dc86121-5f26-4d08-b95f-a4ee2fc8412f"
          - "csb-aws-redis/small"           = "e5cce2ff-ab37-45b2-9f32-15c9aa73666c"
          - "csb-aws-redis/small-ha"        = "005c4f3c-a18d-42e2-b0f5-3fd28c84c730"
          - "csb-aws-s3-bucket/private"     = "167e4815-a058-4fe5-9835-a756551be7ba"
          - "csb-aws-s3-bucket/public-read" = "fb2c6754-cb00-4fdd-84db-57b2ca0b9655"
          - "solr-cloud/base"               = "72c24335-45d6-4bc5-b22b-8d31016b5268"
        } -> null
      - services                         = {
          - "aws-eks-service"    = "852ca7b8-0050-449c-ac4d-72dd449effd5"
          - "csb-aws-dynamodb"   = "576af061-d6e4-43b4-86ec-bd75889946dc"
          - "csb-aws-mysql"      = "2cf8387e-45bd-458b-8a15-97b890e4121f"
          - "csb-aws-postgresql" = "543643c9-4aea-49eb-836a-b33ba99f987f"
          - "csb-aws-redis"      = "a03c2f63-9360-4555-ba09-8a24764d2727"
          - "csb-aws-s3-bucket"  = "6357faba-2ae8-4367-90b5-f0b7f8f30fff"
          - "solr-cloud"         = "c1808441-91eb-4a61-bc7d-9b346b410a33"
        } -> null
      - space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
      - url                              = "https://ssb-deep-dingo.app.cloud.gov" -> null
      - username                         = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/prod"] will be destroyed
  - resource "cloudfoundry_service_broker" "space-scoped-broker" {
      - catalog_change                   = false -> null
      - catalog_hash                     = "pBU_2oU1XYXrWxR06w8kRUf0pB0=" -> null
      - fail_when_catalog_not_accessible = true -> null
      - id                               = "a508e14d-c0d0-42b9-9904-eb3f2458b3d8" -> null
      - name                             = "ssb-gsa-datagov-prod" -> null
      - password                         = (sensitive value)
      - service_plans                    = {
          - "aws-eks-service/raw"           = "07a066d8-9abc-4334-a11c-ce6dd3a3f135"
          - "csb-aws-dynamodb/ondemand"     = "f01e27c0-72f9-4680-a780-8878075f04b5"
          - "csb-aws-dynamodb/provisioned"  = "49f16272-219a-4fa8-999b-37e4721589a6"
          - "csb-aws-mysql/large"           = "f15026da-15aa-47c9-bab2-5c0b6bd2afd7"
          - "csb-aws-mysql/medium"          = "a8971c53-5688-4468-9a34-e2f3425f0d46"
          - "csb-aws-mysql/small"           = "c0ada9ef-30ec-417c-8cf6-9305a9698814"
          - "csb-aws-postgresql/large"      = "1a08d756-ee1f-4b36-9da3-a8d8e0f1f6cc"
          - "csb-aws-postgresql/medium"     = "88932c8f-f89c-4763-b037-577f1071cca6"
          - "csb-aws-postgresql/small"      = "e2c36c21-ce56-4735-9fb8-261b9de729c9"
          - "csb-aws-postgresql/subsume"    = "0e0ff8b1-8398-450a-9684-a1a7ef4eea30"
          - "csb-aws-redis/large"           = "61358fd0-f825-45af-a969-34545215d0dd"
          - "csb-aws-redis/large-ha"        = "1c878384-7f43-493c-a077-d1337803bc82"
          - "csb-aws-redis/medium"          = "b5d9be8b-a27a-415c-bfa6-189536e9a6d1"
          - "csb-aws-redis/medium-ha"       = "79e0754c-6b39-44ec-88aa-6f647a0bee0e"
          - "csb-aws-redis/small"           = "b1521f4b-cbda-4f6c-b7e7-6f3f5069c959"
          - "csb-aws-redis/small-ha"        = "59ece1cd-f0a0-4af8-aded-c60b763d2ece"
          - "csb-aws-s3-bucket/private"     = "89d6020b-3db6-4d17-a666-c08809cce09e"
          - "csb-aws-s3-bucket/public-read" = "66d136e0-89c9-4f2b-ae50-66aab9569f71"
          - "solr-cloud/base"               = "ad4a6f5d-7f04-445f-bf21-0c568ece196e"
        } -> null
      - services                         = {
          - "aws-eks-service"    = "3d5894fa-6423-4318-b63d-dc5fe36b5034"
          - "csb-aws-dynamodb"   = "8385cf39-6f37-4538-a23e-5230be86233e"
          - "csb-aws-mysql"      = "494a5bd9-80a2-4e10-a9fc-2f11e137d694"
          - "csb-aws-postgresql" = "b6e898b9-ec0a-475f-a515-63c7691b0fd1"
          - "csb-aws-redis"      = "8e68ef87-d234-4507-8489-1a3b36eb0281"
          - "csb-aws-s3-bucket"  = "05f6d172-acb1-4aed-943a-0857c09d8f82"
          - "solr-cloud"         = "e05a9cd9-9a24-44e9-99b1-d2b2799cc3a1"
        } -> null
      - space                            = "acbabadb-2604-4736-81f7-01288b0371c6" -> null
      - url                              = "https://ssb-deep-dingo.app.cloud.gov" -> null
      - username                         = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
    }

  # cloudfoundry_service_broker.space-scoped-broker["gsa-datagov/staging"] will be destroyed
  - resource "cloudfoundry_service_broker" "space-scoped-broker" {
      - catalog_change                   = false -> null
      - catalog_hash                     = "pBU_2oU1XYXrWxR06w8kRUf0pB0=" -> null
      - fail_when_catalog_not_accessible = true -> null
      - id                               = "29140105-f171-46c2-9634-5dd8305223a9" -> null
      - name                             = "ssb-gsa-datagov-staging" -> null
      - password                         = (sensitive value)
      - service_plans                    = {
          - "aws-eks-service/raw"           = "fa8434fa-be9d-4b18-86ed-ee5604e551f4"
          - "csb-aws-dynamodb/ondemand"     = "dfed6a70-746b-4fff-b177-f72b72fd713a"
          - "csb-aws-dynamodb/provisioned"  = "09ec15b4-aabb-43be-8847-26e7ff848ba3"
          - "csb-aws-mysql/large"           = "1a09c522-5bd5-4d94-9328-829894945fe3"
          - "csb-aws-mysql/medium"          = "e2782840-7983-4c71-9abb-66edd19c30ee"
          - "csb-aws-mysql/small"           = "4d3f9038-e7c9-42a9-8297-5090945debf1"
          - "csb-aws-postgresql/large"      = "933d351f-1562-4cd7-9957-091ac933a754"
          - "csb-aws-postgresql/medium"     = "a3199365-3cab-4117-b34e-4a146eb9c726"
          - "csb-aws-postgresql/small"      = "57b68e8c-ee5f-4397-8003-f368ae8dff69"
          - "csb-aws-postgresql/subsume"    = "93ad95c6-56c9-4356-bf4a-4281dbad662e"
          - "csb-aws-redis/large"           = "7434ce93-6d22-4cbb-bcca-70dabc555023"
          - "csb-aws-redis/large-ha"        = "52404578-c432-4ac9-a9de-fc7979e02edf"
          - "csb-aws-redis/medium"          = "f873faf0-11c9-4dde-9047-269ac0861a58"
          - "csb-aws-redis/medium-ha"       = "077d17f5-af89-44ac-b4cf-1452279f2aa7"
          - "csb-aws-redis/small"           = "6df5a97f-3984-4781-b74a-d0b29019965f"
          - "csb-aws-redis/small-ha"        = "aa450978-284f-4b34-bcc4-71400a185339"
          - "csb-aws-s3-bucket/private"     = "7f32caee-7992-4011-be0f-65186ef3eb7c"
          - "csb-aws-s3-bucket/public-read" = "778bfbb5-a4aa-457a-aeee-b724fd9893c8"
          - "solr-cloud/base"               = "035c6d11-5212-4210-bb22-35b8547d41e9"
        } -> null
      - services                         = {
          - "aws-eks-service"    = "035b8713-8a0a-4e1d-ac18-36cac510b53e"
          - "csb-aws-dynamodb"   = "df0b395a-a180-444b-b122-92a053157277"
          - "csb-aws-mysql"      = "2823019b-b3ea-43f0-ab65-31874291a625"
          - "csb-aws-postgresql" = "41dc7565-e2a6-4eb3-9a44-b884327f390d"
          - "csb-aws-redis"      = "d60d609c-3875-47b5-a850-16111c0328d6"
          - "csb-aws-s3-bucket"  = "475f2bcd-10b7-4cc3-8f1b-d791657f2cc8"
          - "solr-cloud"         = "ed149070-4d1d-45a5-9e64-723525a73784"
        } -> null
      - space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742" -> null
      - url                              = "https://ssb-deep-dingo.app.cloud.gov" -> null
      - username                         = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
    }

  # cloudfoundry_service_instance.db will be destroyed
  - resource "cloudfoundry_service_instance" "db" {
      - id               = "3c9a0f58-c784-4f71-8872-f2052c95df43" -> null
      - name             = "ssb-db" -> null
      - recursive_delete = false -> null
      - service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> null
      - space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50" -> null
      - tags             = [
          - "mysql",
        ] -> null
    }

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id               = (known after apply)
      + name             = "ssb-k8s"
      + recursive_delete = false
      + service_plan     = (known after apply)
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "k8s",
        ]

      + timeouts {
          + create = "30m"
        }
    }

  # random_password.client_password will be destroyed
  - resource "random_password" "client_password" {
      - id               = "none" -> null
      - length           = 16 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - override_special = "_%@" -> null
      - result           = (sensitive value)
      - special          = true -> null
      - upper            = true -> null
    }

  # random_pet.client_hostname will be destroyed
  - resource "random_pet" "client_hostname" {
      - id        = "deep-dingo" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # random_uuid.client_username will be destroyed
  - resource "random_uuid" "client_username" {
      - id     = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
      - result = "a1582ac8-4a25-1669-b5ca-af0011e0ab25" -> null
    }

  # module.broker_aws.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-aws"
      + path                       = "./app-ssb-aws.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "jDnsF3nzE8ih8Cp/CFLPXfftHJwdOtSBbIQN1u5Regs="
      + space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_aws.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = (known after apply)
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-aws-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-aws-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-aws-gsa-datagov-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "acbabadb-2604-4736-81f7-01288b0371c6"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-aws-gsa-datagov-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_aws.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id               = (known after apply)
      + name             = "ssb-aws-db"
      + recursive_delete = false
      + service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "mysql",
        ]
    }

  # module.broker_aws.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.broker_aws.random_pet.client_hostname will be created
  + resource "random_pet" "client_hostname" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.broker_aws.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.broker_eks.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 512
      + name                       = "ssb-eks"
      + path                       = "./app-ssb-eks.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "QUjLondRNtxdyyf6y2Tc+T5h1HuVoSJZSS3KTd71C6g="
      + space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_eks.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = (known after apply)
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-eks-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-eks-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-eks-gsa-datagov-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "acbabadb-2604-4736-81f7-01288b0371c6"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-eks-gsa-datagov-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_eks.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id               = (known after apply)
      + name             = "ssb-eks-db"
      + recursive_delete = false
      + service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "mysql",
        ]
    }

  # module.broker_eks.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.broker_eks.random_pet.client_hostname will be created
  + resource "random_pet" "client_hostname" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.broker_eks.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-solr"
      + path                       = "./app-ssb-solr.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "RrwYpMoh/xKGoHOwyE8XYO3+Ef1OCBgQow1ZUZ/qeN8="
      + space                      = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_solr.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = "50ba3f69-cd54-4963-9172-14f3334b479e"
      + endpoint = (known after apply)
      + hostname = (known after apply)
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/development"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-development"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "eab3d327-7d9f-423b-9838-753c26fdb5a0"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-management"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/prod"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-prod"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "acbabadb-2604-4736-81f7-01288b0371c6"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = true
      + id                               = (known after apply)
      + name                             = "ssb-ssb-solr-gsa-datagov-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "3e692cdd-6d26-41ea-9698-04903dc3f742"
      + url                              = (known after apply)
      + username                         = (known after apply)
    }

  # module.broker_solr.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id               = (known after apply)
      + name             = "ssb-solr-db"
      + recursive_delete = false
      + service_plan     = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
      + space            = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags             = [
          + "mysql",
        ]
    }

  # module.broker_solr.random_password.client_password will be created
  + resource "random_password" "client_password" {
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.broker_solr.random_pet.client_hostname will be created
  + resource "random_pet" "client_hostname" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.broker_solr.random_uuid.client_username will be created
  + resource "random_uuid" "client_username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 31 to add, 0 to change, 10 to destroy.
```
</details>

Plan generated in [plan #11](https://github.com/GSA/datagov-ssb/actions/runs/662640495)